examples/euler3d/fine/system/lines
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

type sets;
libs    ("libsampling.so");

interpolationScheme      cellPoint;

setFormat   raw;

sets
(
xlineCenter
{
type            uniform;
axis            x;
start           (-640    0.00001 0.000001);
end             (640     0.00001 0.000001);
nPoints         512;
}

);


fields                  (U p);

// ************************************************************************* //
